# GroupSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupSet Class
Members See Also
---
An set that contains groups.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class GroupSet : APIObject, IEnumerable
```

Visual Basic
---
```text
Public Class GroupSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class GroupSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..GroupSet
# See Also
GroupSet Members
Autodesk.Revit.DB Namespace